app/views/epicenter/feed.html.erb

                    <tr>
                      <td><%= current_user.tweets.count%></td>
---
SELECT "tweets".* FROM "tweets"

              <p>
                <% if tweet.user.avatar.blank? == false %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]