app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Hello world!"], ["user_id", 1], ["created_at", "2017-12-12 01:14:17.691393"], ["updated_at", "2017-12-12 01:14:17.691393"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save